{"posts":[{"title":"テストテスト","text":"Checking package dependenciesmeowTEST TEST testテストテスト","link":"/blog/older/journal.2022.8.19/"},{"title":"One day she will leave and never come back","text":"It was meant to be a day of joy,Yet moisture pools in her eyes.The one meant to be closest,Carelessly hurt her so bad. Long she thought her heart had hardened,Immune to hate, to love, to feel.But the armor was mere illusion,Her fragile heart beneath was real. Kindness, they said, she must possess,Yet those who preached it turned away.They claimed divinity was fiction,But who would mend her heart’s dismay? No harm to others did she wish,Her soul yearned for distant skies.To dwell in valleys, calm and serene,Where sorrow ends and pain subsides. Yet amidst the turmoil, she becomes resilient,A quiet determination to endure.She knows her strength will see her through,For in this quest, that is the meaning of her life.","link":"/blog/202403/whydoyoufuckingstillnotunderstand/"},{"title":"The SSH passwordless login for Linux VPS","text":"Regarding SSH login on Linux, it’s seemingly simple but I always forget which step. So, I’m writing it down now to prevent forgetting in the future. StepsFirst, generate the public and private keys in the local terminal: 1ssh-keygen -t rsa Just press Enter all the way. Once done, transfer the local public key to the VPS: 1scp ~/.ssh/id_rsa.pub user@hostname:~/.ssh/ Finally, add the transferred public key to ~/.ssh/authorized_keys on the VPS: 1cat ~/.ssh/id_rsa.pub &gt;~/.ssh/authorized_keys If the operation was performed as root, when SSHing, you might encounter: 1WARNING: UNPROTECTED PRIVATE KEY FILE! The error indicates that the private key is too exposed. Change the permissions to fix this: 1chmod 600 ~/.ssh/id_rsa You can also set up multiple VPS logins in ~/.ssh/config: 12vi ~/.ssh/config Add configurations like: >unfolded12345Host myvpsUser usernameHostName IP_or_domain_of_vpsPort 22 (default)IdentityFile ~/.ssh/id_rsa After that, you might still encounter permission issues mentioned above. Similarly, change the permission to 600: 1chmod 600 ~/.ssh/config All done!","link":"/blog/older/login_without-pwd/"},{"title":"It&#39;s over! 2018","text":"End of 2018! In the blink of an eye, it’s 2019, and finally, I’m no longer a student. When I was young, I eagerly wished to grow up quickly, but now I’m beginning to feel the passage of time. Recently, I’ve been reading ‘Sophie’s World,’ and it’s truly a wonderful book. It makes me think about philosophical questions like whether consciousness exists after death more often. I’m increasingly aware of how insignificant one person is; I’m just an ordinary person after all. What will I be like in 10 years? I’m curious and eager to find out. But in 10 years, I’ll be older too. And what about after that year? I think I’ll definitely be living a better life than I am now. Life always gets better slowly. Just go with the flow.","link":"/blog/older/over_of_2018/"}],"tags":[{"name":"Journal","slug":"Journal","link":"/tags/Journal/"},{"name":"AI","slug":"AI","link":"/tags/AI/"},{"name":"ssh","slug":"ssh","link":"/tags/ssh/"},{"name":"linux","slug":"linux","link":"/tags/linux/"}],"categories":[{"name":"Journal","slug":"Journal","link":"/categories/Journal/"},{"name":"Linux","slug":"Linux","link":"/categories/Linux/"}],"pages":[{"title":"About","text":"Atticus","link":"/about/index.html"},{"title":"resume","text":"","link":"/resume/index.html"},{"title":"Tags","text":"","link":"/tags/index.html"},{"title":"Categories","text":"","link":"/categories/index.html"}]}